/**
 * 判断输入的参数是否是个合格的手机号码，不能判断号码的有效性，有效性可以通过运营商确定。
 *
 * @function
 * @memberof Fx
 * @param {String} str 表示手机号码的字符串
 * @returns {Boolean}
 * @example
 *
 * // -> true
 * Fx.checkPhone('15209862526');
 * // -> false
 * Fx.checkPhone('19006052324');
 */
const checkPhone = (str: string): boolean => {
  /*
   * 手机号码段规则
   * 13段：130、131、132、133、134、135、136、137、138、139
   * 14段：145、147
   * 15段：150、151、152、153、155、156、157、158、159
   * 17段：170、176、177、178
   * 18段：180、181、182、183、184、185、186、187、188、189
   */
  return /^(13[0-9]|14[57]|15[012356789]|17[0678]|18[0-9])\d{8}$/.test(str);
};

export default checkPhone;
